Khanh0107/STM32_Register/01_Driver/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stdint.h>
#include <stm32f7.h>
#include "stm32_gpio.h"

void delay()
{
	for(uint32_t i = 0; i < 500000; i++);
}

int a = 0;

int main(void)
{
	GPIO_Handle_t GpioLedB0, GpioBtn;

	// this is led GPIO configuration
	GpioLedB0.pGPIOx = GPIOB;
	GpioLedB0.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_0;
	GpioLedB0.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	GpioLedB0.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GpioLedB0.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	GpioLedB0.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	GPIO_Init(&GpioLedB0);
	GPIO_WriteToOutputPin(GPIOB,GPIO_PIN_NO_0,GPIO_PIN_RESET);

	//this is btn gpio configuration
	GpioBtn.pGPIOx = GPIOB;
	GpioBtn.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_11;
	GpioBtn.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IT_FT;
	GpioBtn.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GpioBtn.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PU;
	GPIO_Init(&GpioBtn);
	//IRQ configurations
	GPIO_IRQPriorityConfig(IRQ_NO_EXTI15_10, 3);
	GPIO_IRQInterruptConfig(IRQ_NO_EXTI15_10, ENABLE);

	while(1)
	{

	}


	return 0;
}

void EXTI15_10_IRQHandler()
{
    delay();
    GPIO_IRQHandling(GPIO_PIN_NO_11);
    GPIO_ToggleOutputPin(GPIOB, GPIO_PIN_NO_0);
    a++;
}
